README.md
```mermaid
classDiagram
    class Usuario {
        +int id
        +String user
        +String nome
        +String email
        +String telefone
        +String password
    }
    class Avaliacao {
        +int id
        +float nota
        +String comentario
        +String fotoURL
        +boolean favorito
    }
    class ReacaoAvaliacao {
        +int id
        +Reacao tipo
    }
    class Reacao {
        <<enumeration>>
        LIKE
        DISLIKE
    }
    class Restaurante {
        +int id
        +String nome
        +String endereco
        +float notaMedia
        +int qntdAvaliacoes
        +String fotoURL
    }
    class Categoria {
        +int id
        +String nome
    }
    class CategoriaRestaurante {
        +int categoriaId
        +int restauranteId
    }

    Usuario "1" --> "0..*" Avaliacao : faz
    Restaurante "1" --> "0..*" Avaliacao : recebe
    Restaurante "1" --> "0..*" CategoriaRestaurante : tem
    Categoria "1" --> "0..*" CategoriaRestaurante : classifica
    Avaliacao "1" --> "0..*" ReacaoAvaliacao : recebe
    Usuario "1" --> "0..*" ReacaoAvaliacao : faz
    ReacaoAvaliacao --> Reacao : tipo
```
